iNavFlight/inav/src/main/drivers/system_stm32h7ax.c
  /* USER CODE END USART3_Init 2 */
#endif
}

/**
  * @brief USART6 Initialization Function
  * @param None
  * @retval None
  */
void MX_USART6_UART_Init(void)
{
#if 0
  /* USER CODE BEGIN USART6_Init 0 */

  /* USER CODE END USART6_Init 0 */

  /* USER CODE BEGIN USART6_Init 1 */

  /* USER CODE END USART6_Init 1 */
  huart6.Instance = USART6;
  huart6.Init.BaudRate = 115200;
  huart6.Init.WordLength = UART_WORDLENGTH_8B;
  huart6.Init.StopBits = UART_STOPBITS_1;
  huart6.Init.Parity = UART_PARITY_NONE;
  huart6.Init.Mode = UART_MODE_TX_RX;
  huart6.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart6.Init.OverSampling = UART_OVERSAMPLING_16;
  huart6.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
  huart6.Init.ClockPrescaler = UART_PRESCALER_DIV1;
  huart6.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
  if (HAL_UART_Init(&huart6) != HAL_OK)
  {
    Error_Handler();
  }
  if (HAL_UARTEx_SetTxFifoThreshold(&huart6, UART_TXFIFO_THRESHOLD_1_8) != HAL_OK)
  {
    Error_Handler();
  }
  if (HAL_UARTEx_SetRxFifoThreshold(&huart6, UART_RXFIFO_THRESHOLD_1_8) != HAL_OK)
  {
    Error_Handler();
  }
  if (HAL_UARTEx_DisableFifoMode(&huart6) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN USART6_Init 2 */

  /* USER CODE END USART6_Init 2 */
#endif
}

/**
  * Enable DMA controller clock
  * Configure DMA for memory to memory transfers
  *   hdma_memtomem_bdma1_channel0
  */
void MX_BDMA1_Init(void)
{
#if 0
  /* DMA controller clock enable */
  __HAL_RCC_BDMA1_CLK_ENABLE();

  /* Configure DMA request hdma_memtomem_bdma1_channel0 on BDMA1_Channel0 */
  hdma_memtomem_bdma1_channel0.Instance = BDMA1_Channel0;
  hdma_memtomem_bdma1_channel0.Init.Direction = DMA_MEMORY_TO_MEMORY;
  hdma_memtomem_bdma1_channel0.Init.PeriphInc = DMA_PINC_ENABLE;
  hdma_memtomem_bdma1_channel0.Init.MemInc = DMA_MINC_ENABLE;
  hdma_memtomem_bdma1_channel0.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
  hdma_memtomem_bdma1_channel0.Init.MemDataAlignment = DMA_MDATAALIGN_WORD;
  hdma_memtomem_bdma1_channel0.Init.Mode = DMA_NORMAL;
  hdma_memtomem_bdma1_channel0.Init.Priority = DMA_PRIORITY_LOW;
  if (HAL_DMA_Init(&hdma_memtomem_bdma1_channel0) != HAL_OK)
  {
    Error_Handler( );
  }
#endif
}

/**
  * Enable DMA controller clock
  * Configure DMA for memory to memory transfers
  *   hdma_bdma_generator0
  */
void MX_BDMA2_Init(void)
{
#if 0
  /* Local variables */
  HAL_DMA_MuxSyncConfigTypeDef pSyncConfig = {0};

  /* DMA controller clock enable */
  __HAL_RCC_BDMA2_CLK_ENABLE();

  /* Configure DMA request hdma_bdma_generator0 on BDMA2_Channel0 */
  hdma_bdma_generator0.Instance = BDMA2_Channel0;
  hdma_bdma_generator0.Init.Request = BDMA_REQUEST_GENERATOR0;
  hdma_bdma_generator0.Init.Direction = DMA_PERIPH_TO_MEMORY;
  hdma_bdma_generator0.Init.PeriphInc = DMA_PINC_DISABLE;
  hdma_bdma_generator0.Init.MemInc = DMA_MINC_ENABLE;
  hdma_bdma_generator0.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
  hdma_bdma_generator0.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
  hdma_bdma_generator0.Init.Mode = DMA_CIRCULAR;
  hdma_bdma_generator0.Init.Priority = DMA_PRIORITY_LOW;
  if (HAL_DMA_Init(&hdma_bdma_generator0) != HAL_OK)
  {
    Error_Handler( );
  }

  /* Configure the DMAMUX synchronization parameters for the selected BDMA channel */
  pSyncConfig.SyncSignalID = HAL_DMAMUX2_SYNC_EXTI0;
  pSyncConfig.SyncPolarity = HAL_DMAMUX_SYNC_NO_EVENT;
  pSyncConfig.SyncEnable = DISABLE;
  pSyncConfig.EventEnable = ENABLE;
  pSyncConfig.RequestNumber = 1;
  if (HAL_DMAEx_ConfigMuxSync(&hdma_bdma_generator0, &pSyncConfig) != HAL_OK)
  {
    Error_Handler( );
  }
#endif
}

/**
  * Enable DMA controller clock
  * Configure DMA for memory to memory transfers
  *   hdma_dma_generator0
  *   hdma_dma_generator2
  */
void MX_DMA_Init(void)
{
#if 0
  /* Local variables */
  HAL_DMA_MuxSyncConfigTypeDef pSyncConfig = {0};

  /* DMA controller clock enable */
  __HAL_RCC_DMA1_CLK_ENABLE();

  /* Configure DMA request hdma_dma_generator0 on DMA1_Stream0 */
  hdma_dma_generator0.Instance = DMA1_Stream0;
  hdma_dma_generator0.Init.Request = DMA_REQUEST_GENERATOR0;
  hdma_dma_generator0.Init.Direction = DMA_PERIPH_TO_MEMORY;
  hdma_dma_generator0.Init.PeriphInc = DMA_PINC_DISABLE;
  hdma_dma_generator0.Init.MemInc = DMA_MINC_ENABLE;
  hdma_dma_generator0.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
  hdma_dma_generator0.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
  hdma_dma_generator0.Init.Mode = DMA_NORMAL;
  hdma_dma_generator0.Init.Priority = DMA_PRIORITY_LOW;
  hdma_dma_generator0.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
  if (HAL_DMA_Init(&hdma_dma_generator0) != HAL_OK)
  {
    Error_Handler( );
  }

  /* Configure DMA request hdma_dma_generator2 on DMA1_Stream1 */
  hdma_dma_generator2.Instance = DMA1_Stream1;
  hdma_dma_generator2.Init.Request = DMA_REQUEST_GENERATOR2;
  hdma_dma_generator2.Init.Direction = DMA_PERIPH_TO_MEMORY;
  hdma_dma_generator2.Init.PeriphInc = DMA_PINC_DISABLE;
  hdma_dma_generator2.Init.MemInc = DMA_MINC_ENABLE;
  hdma_dma_generator2.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
  hdma_dma_generator2.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
  hdma_dma_generator2.Init.Mode = DMA_CIRCULAR;
  hdma_dma_generator2.Init.Priority = DMA_PRIORITY_LOW;
  hdma_dma_generator2.Init.FIFOMode = DMA_FIFOMODE_ENABLE;
  hdma_dma_generator2.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_FULL;
  hdma_dma_generator2.Init.MemBurst = DMA_MBURST_SINGLE;
  hdma_dma_generator2.Init.PeriphBurst = DMA_PBURST_SINGLE;
  if (HAL_DMA_Init(&hdma_dma_generator2) != HAL_OK)
  {
    Error_Handler( );
  }

  /* Configure the DMAMUX synchronization parameters for the selected DMA stream */
  pSyncConfig.SyncSignalID = HAL_DMAMUX1_SYNC_EXTI0;
  pSyncConfig.SyncPolarity = HAL_DMAMUX_SYNC_NO_EVENT;
  pSyncConfig.SyncEnable = DISABLE;
  pSyncConfig.EventEnable = ENABLE;
  pSyncConfig.RequestNumber = 1;
  if (HAL_DMAEx_ConfigMuxSync(&hdma_dma_generator2, &pSyncConfig) != HAL_OK)
  {
    Error_Handler( );
  }
#endif
}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */

void EnableGPIOClocks(void)
{
#ifdef GPIOA
    __HAL_RCC_GPIOA_CLK_ENABLE();
#endif
#ifdef GPIOB
    __HAL_RCC_GPIOB_CLK_ENABLE();
#endif
#ifdef GPIOC
    __HAL_RCC_GPIOC_CLK_ENABLE();
#endif
#ifdef GPIOD
    __HAL_RCC_GPIOD_CLK_ENABLE();
#endif
#ifdef GPIOE
    __HAL_RCC_GPIOE_CLK_ENABLE();
#endif
#ifdef GPIOF
    __HAL_RCC_GPIOF_CLK_ENABLE();
#endif
#ifdef GPIOG
    __HAL_RCC_GPIOG_CLK_ENABLE();
#endif
#ifdef GPIOH
    __HAL_RCC_GPIOH_CLK_ENABLE();
#endif
#ifdef GPIOI
    __HAL_RCC_GPIOI_CLK_ENABLE();
#endif
#ifdef GPIOJ
    __HAL_RCC_GPIOJ_CLK_ENABLE();
#endif
#ifdef GPIOK
    __HAL_RCC_GPIOK_CLK_ENABLE();
#endif
}

void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};
/* USER CODE BEGIN MX_GPIO_Init_1 */
/* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  EnableGPIOClocks();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13|GPIO_PIN_14|GPIO_PIN_15|GPIO_PIN_0
                          |GPIO_PIN_4, GPIO_PIN_RESET);

